In [2]:
import pandas as pd
sales = pd.read_csv('sales.csv', index_col = 0)
sales.head()

        Mon  Tue  Wed   Thu  Fri
Steven   34   27   15   NaN   33
Mike     45    9   74  87.0   12
Andi     17   33   54   8.0   29
Paul     87   67   27  45.0    7

In [4]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Steven to Paul
Data columns (total 5 columns):
Mon    4 non-null int64
Tue    4 non-null int64
Wed    4 non-null int64
Thu    3 non-null float64
Fri    4 non-null int64
dtypes: float64(1), int64(4)
memory usage: 192.0+ bytes

In [5]:
sales.min(axis = 0) #min value in each column

Mon    17.0
Tue     9.0
Wed    15.0
Thu     8.0
Fri     7.0
dtype: float64

In [6]:
sales.min(axis = 1) #min value in each row

Steven    15.0
Mike       9.0
Andi       8.0
Paul       7.0
dtype: float64

In [8]:
def range(series):
    return series.max() - series.min()

In [9]:
sales.apply(range, axis = 0) #apply a function on each row/column

Mon    70.0
Tue    58.0
Wed    59.0
Thu    79.0
Fri    26.0
dtype: float64

In [11]:
sales.apply(range, axis = 1)

Steven    19.0
Mike      78.0
Andi      46.0
Paul      80.0
dtype: float64

In [12]:
sales.apply(lambda x:x.max() - x.min(), axis = 1)

Steven    19.0
Mike      78.0
Andi      46.0
Paul      80.0
dtype: float64

In [13]:
summer = pd.read_csv('summer.csv')
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [14]:
summer.Athlete

0                    HAJOS, Alfred
1                 HERSCHMANN, Otto
2                DRIVAS, Dimitrios
3               MALOKINIS, Ioannis
4               CHASAPIS, Spiridon
                   ...
31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, Length: 31165, dtype: object

## User defined function on all columns or rows of a dataframe

In [17]:
summer.Athlete.apply(lambda x:x[0])

0        H
1        H
2        D
3        M
4        C
        ..
31160    J
31161    R
31162    T
31163    A
31164    L
Name: Athlete, Length: 31165, dtype: object

In [18]:
summer.Athlete.apply(lambda x:x.split(',')[0])

0             HAJOS
1        HERSCHMANN
2            DRIVAS
3         MALOKINIS
4          CHASAPIS
            ...
31160    JANIKOWSKI
31161        REZAEI
31162        TOTROV
31163    ALEKSANYAN
31164       LIDBERG
Name: Athlete, Length: 31165, dtype: object

In [19]:
summer.Athlete.map(lambda x:x.split(',')[0])

0             HAJOS
1        HERSCHMANN
2            DRIVAS
3         MALOKINIS
4          CHASAPIS
            ...
31160    JANIKOWSKI
31161        REZAEI
31162        TOTROV
31163    ALEKSANYAN
31164       LIDBERG
Name: Athlete, Length: 31165, dtype: object

## User defined function on all elements of a dataframe 

## applymap

In [21]:
summer.iloc[:,1:3]

         City      Sport
0      Athens   Aquatics
1      Athens   Aquatics
2      Athens   Aquatics
3      Athens   Aquatics
4      Athens   Aquatics
...       ...        ...
31160  London  Wrestling
31161  London  Wrestling
31162  London  Wrestling
31163  London  Wrestling
31164  London  Wrestling

[31165 rows x 2 columns]

In [22]:
summer.iloc[:,1:3].applymap(lambda x : x[0])

      City Sport
0        A     A
1        A     A
2        A     A
3        A     A
4        A     A
...    ...   ...
31160    L     W
31161    L     W
31162    L     W
31163    L     W
31164    L     W

[31165 rows x 2 columns]

In [23]:
sales

        Mon  Tue  Wed   Thu  Fri
Steven   34   27   15   NaN   33
Mike     45    9   74  87.0   12
Andi     17   33   54   8.0   29
Paul     87   67   27  45.0    7

In [24]:
sales.applymap(lambda x: 0.4*x-5)

         Mon   Tue   Wed   Thu  Fri
Steven   8.6   5.8   1.0   NaN  8.2
Mike    13.0  -1.4  24.6  29.8 -0.2
Andi     1.8   8.2  16.6  -1.8  6.6
Paul    29.8  21.8   5.8  13.0 -2.2

In [25]:
sales*0.4-5

         Mon   Tue   Wed   Thu  Fri
Steven   8.6   5.8   1.0   NaN  8.2
Mike    13.0  -1.4  24.6  29.8 -0.2
Andi     1.8   8.2  16.6  -1.8  6.6
Paul    29.8  21.8   5.8  13.0 -2.2